api/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "category_id", "image_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @product = current_user.products.build(product_params)

    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", "1.3459"], ["updated_at", "2023-04-22 21:55:38.799934"], ["id", 12]]
---
  def update
    product = Product.find_by(id: params[:id])
    render_not_found_response unless product.valid?
    product.update(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_product
    Product.find_by(id: params[:id]) || raise(ActiveRecord::RecordNotFound)

SELECT "products".* FROM "products" WHERE "products"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def authorize_owner
    product = Product.find_by(id: params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def authorize_owner
    product = Product.find_by(id: params[:id])